# SetAnalyticalProjectionDatumPlane Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSketchComponent..::..SetAnalyticalProjectionDatumPlane Method
AnalyticalModelSketchComponent Class See Also
---
Sets the Analytical Projection to supplied Datum Plane.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void SetAnalyticalProjectionDatumPlane(
	ElementId datumPlaneId
)
```

Visual Basic
---
```text
Public Sub SetAnalyticalProjectionDatumPlane ( _
	datumPlaneId As ElementId _
)
```

Visual C++
---
```text
public:
void SetAnalyticalProjectionDatumPlane(
	ElementId^ datumPlaneId
)
```

# ### Parameters
datumPlaneId
    Type: Autodesk.Revit.DB..::..ElementId Identifies Datum Plane ElementId.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | datumPlaneId is not valid for this Sketch Component. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalModelSketchComponent Class
Autodesk.Revit.DB.Structure Namespace